# Задача 3
# Требуется вывести все целые степени двойки 
# (т.е. числа вида 2k), не превосходящие числа N.
# 10 -> 1 2 4 8

print('----------------------------------')
numb = int(input("Введите число "))
deg = 1
result = 1

print()
while result < numb:
    print(result)
    result = 2 ** deg
    deg += 1

print('----------------------------------')